In [1]:
import pandas as pd
# using postgres
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [2]:
# DATA EXTRACTION  :robotuf? data type, csv, json etc
# data -1 customer name dataset. first set
csv_file = "../Resources/customer_data.csv"

   id first_name last_name                       email  gender            car
0   1    Benetta   Cancott   bcancott0@studiopress.com  Female          Scion
1   2     Lilyan    Cherry  lcherry1@deliciousdays.com  Female       Chrysler
2   3    Ezekiel   Benasik         ebenasik2@wikia.com    Male  Mercedes-Benz
3   4    Kennedy     Atlay        katlay3@so-net.ne.jp    Male          Buick
4   5    Sanford    Salmen        ssalmen4@reuters.com    Male        Lincoln

### Create new data with select columns

In [3]:
# DATA TRANSFORMation
# need only these 3 columns, don't have to use .copy()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

In [4]:
# check the datatypes, match the datatypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
dtypes: int64(1), object(2)
memory usage: 23.6+ KB

In [ ]:
# How to check missing values as
# looked at values , all 3 values, same...
# have everything for first table
# information in json file, both will work, csv format of data is screwed up.

### Store JSON data into a DataFrame

In [5]:
# EXTRACT 3 columns need
# same output read csv, output is hard to read
# json file, comes back nicely

   id                address  longitude  latitude  us_state
0   1  043 Mockingbird Place   -86.5186   39.1682   Indiana
1   2       4 Prentice Point   -85.0707   41.0938   Indiana
2   3      46 Derek Junction   -96.7776   32.7673     Texas
3   4  11966 Old Shore Place   -94.3567   39.0350  Missouri
4   5     5 Evergreen Circle   -73.9772   40.7808  New York

### Clean DataFrame

In [6]:
# TRANSFORM < CLEAN, double brackets when a few columns

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York

In [7]:
new_customer_location_df.info()
# df.dtypes
# df.count()
# df.isnull()   # gives boolean return

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1000 non-null   int64
 1   address   1000 non-null   object
 2   us_state  1000 non-null   object
dtypes: int64(1), object(2)
memory usage: 23.6+ KB

### Connect to local database

In [8]:
rds_connection_string = "postgres:@localhost:5432/Customers_db"
#rds_connection_string = "<insert user name>:<insert password>@localhost:5432/Customers_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [9]:
engine

Engine(postgresql://postgres:***@localhost:5432/Customers_db)

### Check for tables

In [10]:
engine.table_names()

['customer_name', 'customer_location']

### Use pandas to load csv converted DataFrame into database

### Use pandas to load json converted DataFrame into database

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Confirm data has been added by querying the customer_location table

   id                address  us_state
0   1  043 Mockingbird Place   Indiana
1   2       4 Prentice Point   Indiana
2   3      46 Derek Junction     Texas
3   4  11966 Old Shore Place  Missouri
4   5     5 Evergreen Circle  New York